loadtest/tmp-post-cache/summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtest/k6-browse.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 2m50s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 2m20s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 004/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 004/100 VUs  0m01.0s/2m20.0s

running (0m02.0s), 007/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 007/100 VUs  0m02.0s/2m20.0s

running (0m03.0s), 010/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 010/100 VUs  0m03.0s/2m20.0s

running (0m04.0s), 014/100 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 014/100 VUs  0m04.0s/2m20.0s

running (0m05.0s), 017/100 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 017/100 VUs  0m05.0s/2m20.0s

running (0m06.0s), 020/100 VUs, 1 complete and 0 interrupted iterations
default   [   4% ] 020/100 VUs  0m06.0s/2m20.0s

running (0m07.0s), 023/100 VUs, 1 complete and 0 interrupted iterations
default   [   5% ] 023/100 VUs  0m07.0s/2m20.0s

running (0m08.0s), 027/100 VUs, 1 complete and 0 interrupted iterations
default   [   6% ] 027/100 VUs  0m08.0s/2m20.0s

running (0m09.0s), 030/100 VUs, 2 complete and 0 interrupted iterations
default   [   6% ] 030/100 VUs  0m09.0s/2m20.0s

running (0m10.0s), 033/100 VUs, 5 complete and 0 interrupted iterations
default   [   7% ] 033/100 VUs  0m10.0s/2m20.0s

running (0m11.0s), 037/100 VUs, 8 complete and 0 interrupted iterations
default   [   8% ] 037/100 VUs  0m11.0s/2m20.0s

running (0m12.0s), 040/100 VUs, 10 complete and 0 interrupted iterations
default   [   9% ] 040/100 VUs  0m12.0s/2m20.0s

running (0m13.0s), 043/100 VUs, 13 complete and 0 interrupted iterations
default   [   9% ] 043/100 VUs  0m13.0s/2m20.0s

running (0m14.0s), 047/100 VUs, 19 complete and 0 interrupted iterations
default   [  10% ] 047/100 VUs  0m14.0s/2m20.0s

running (0m15.0s), 050/100 VUs, 21 complete and 0 interrupted iterations
default   [  11% ] 050/100 VUs  0m15.0s/2m20.0s

running (0m16.0s), 053/100 VUs, 25 complete and 0 interrupted iterations
default   [  11% ] 053/100 VUs  0m16.0s/2m20.0s

running (0m17.0s), 056/100 VUs, 29 complete and 0 interrupted iterations
default   [  12% ] 056/100 VUs  0m17.0s/2m20.0s

running (0m18.0s), 060/100 VUs, 35 complete and 0 interrupted iterations
default   [  13% ] 060/100 VUs  0m18.0s/2m20.0s

running (0m19.0s), 063/100 VUs, 41 complete and 0 interrupted iterations
default   [  14% ] 063/100 VUs  0m19.0s/2m20.0s

running (0m20.0s), 066/100 VUs, 47 complete and 0 interrupted iterations
default   [  14% ] 066/100 VUs  0m20.0s/2m20.0s

running (0m21.0s), 070/100 VUs, 54 complete and 0 interrupted iterations
default   [  15% ] 070/100 VUs  0m21.0s/2m20.0s

running (0m22.0s), 073/100 VUs, 59 complete and 0 interrupted iterations
default   [  16% ] 073/100 VUs  0m22.0s/2m20.0s

running (0m23.0s), 076/100 VUs, 62 complete and 0 interrupted iterations
default   [  16% ] 076/100 VUs  0m23.0s/2m20.0s

running (0m24.0s), 080/100 VUs, 70 complete and 0 interrupted iterations
default   [  17% ] 080/100 VUs  0m24.0s/2m20.0s

running (0m25.0s), 083/100 VUs, 81 complete and 0 interrupted iterations
default   [  18% ] 083/100 VUs  0m25.0s/2m20.0s

running (0m26.0s), 086/100 VUs, 87 complete and 0 interrupted iterations
default   [  19% ] 086/100 VUs  0m26.0s/2m20.0s

running (0m27.0s), 089/100 VUs, 94 complete and 0 interrupted iterations
default   [  19% ] 089/100 VUs  0m27.0s/2m20.0s

running (0m28.0s), 093/100 VUs, 100 complete and 0 interrupted iterations
default   [  20% ] 093/100 VUs  0m28.0s/2m20.0s

running (0m29.0s), 096/100 VUs, 107 complete and 0 interrupted iterations
default   [  21% ] 096/100 VUs  0m29.0s/2m20.0s

running (0m30.0s), 099/100 VUs, 115 complete and 0 interrupted iterations
default   [  21% ] 099/100 VUs  0m30.0s/2m20.0s

running (0m31.0s), 100/100 VUs, 120 complete and 0 interrupted iterations
default   [  22% ] 100/100 VUs  0m31.0s/2m20.0s

running (0m32.0s), 100/100 VUs, 126 complete and 0 interrupted iterations
default   [  23% ] 100/100 VUs  0m32.0s/2m20.0s

running (0m33.0s), 100/100 VUs, 136 complete and 0 interrupted iterations
default   [  24% ] 100/100 VUs  0m33.0s/2m20.0s

running (0m34.0s), 100/100 VUs, 146 complete and 0 interrupted iterations
default   [  24% ] 100/100 VUs  0m34.0s/2m20.0s

running (0m35.0s), 100/100 VUs, 162 complete and 0 interrupted iterations
default   [  25% ] 100/100 VUs  0m35.0s/2m20.0s

running (0m36.0s), 100/100 VUs, 170 complete and 0 interrupted iterations
default   [  26% ] 100/100 VUs  0m36.0s/2m20.0s

running (0m37.0s), 100/100 VUs, 179 complete and 0 interrupted iterations
default   [  26% ] 100/100 VUs  0m37.0s/2m20.0s

running (0m38.0s), 100/100 VUs, 190 complete and 0 interrupted iterations
default   [  27% ] 100/100 VUs  0m38.0s/2m20.0s

running (0m39.0s), 100/100 VUs, 200 complete and 0 interrupted iterations
default   [  28% ] 100/100 VUs  0m39.0s/2m20.0s

running (0m40.0s), 100/100 VUs, 209 complete and 0 interrupted iterations
default   [  29% ] 100/100 VUs  0m40.0s/2m20.0s

running (0m41.0s), 100/100 VUs, 219 complete and 0 interrupted iterations
default   [  29% ] 100/100 VUs  0m41.0s/2m20.0s

running (0m42.0s), 100/100 VUs, 225 complete and 0 interrupted iterations
default   [  30% ] 100/100 VUs  0m42.0s/2m20.0s

running (0m43.0s), 100/100 VUs, 230 complete and 0 interrupted iterations
default   [  31% ] 100/100 VUs  0m43.0s/2m20.0s

running (0m44.0s), 100/100 VUs, 240 complete and 0 interrupted iterations
default   [  31% ] 100/100 VUs  0m44.0s/2m20.0s

running (0m45.0s), 100/100 VUs, 251 complete and 0 interrupted iterations
default   [  32% ] 100/100 VUs  0m45.0s/2m20.0s

running (0m46.0s), 100/100 VUs, 266 complete and 0 interrupted iterations
default   [  33% ] 100/100 VUs  0m46.0s/2m20.0s

running (0m47.0s), 100/100 VUs, 275 complete and 0 interrupted iterations
default   [  34% ] 100/100 VUs  0m47.0s/2m20.0s

running (0m48.0s), 100/100 VUs, 287 complete and 0 interrupted iterations
default   [  34% ] 100/100 VUs  0m48.0s/2m20.0s

running (0m49.0s), 100/100 VUs, 296 complete and 0 interrupted iterations
default   [  35% ] 100/100 VUs  0m49.0s/2m20.0s

running (0m50.0s), 100/100 VUs, 311 complete and 0 interrupted iterations
default   [  36% ] 100/100 VUs  0m50.0s/2m20.0s

running (0m51.0s), 100/100 VUs, 318 complete and 0 interrupted iterations
default   [  36% ] 100/100 VUs  0m51.0s/2m20.0s

running (0m52.0s), 100/100 VUs, 330 complete and 0 interrupted iterations
default   [  37% ] 100/100 VUs  0m52.0s/2m20.0s

running (0m53.0s), 100/100 VUs, 342 complete and 0 interrupted iterations
default   [  38% ] 100/100 VUs  0m53.0s/2m20.0s

running (0m54.0s), 100/100 VUs, 349 complete and 0 interrupted iterations
default   [  39% ] 100/100 VUs  0m54.0s/2m20.0s

running (0m55.0s), 100/100 VUs, 360 complete and 0 interrupted iterations
default   [  39% ] 100/100 VUs  0m55.0s/2m20.0s

running (0m56.0s), 100/100 VUs, 373 complete and 0 interrupted iterations
default   [  40% ] 100/100 VUs  0m56.0s/2m20.0s

running (0m57.0s), 100/100 VUs, 378 complete and 0 interrupted iterations
default   [  41% ] 100/100 VUs  0m57.0s/2m20.0s

running (0m58.0s), 100/100 VUs, 384 complete and 0 interrupted iterations
default   [  41% ] 100/100 VUs  0m58.0s/2m20.0s

running (0m59.0s), 100/100 VUs, 389 complete and 0 interrupted iterations
default   [  42% ] 100/100 VUs  0m59.0s/2m20.0s

running (1m00.0s), 100/100 VUs, 405 complete and 0 interrupted iterations
default   [  43% ] 100/100 VUs  1m00.0s/2m20.0s

running (1m01.0s), 100/100 VUs, 416 complete and 0 interrupted iterations
default   [  44% ] 100/100 VUs  1m01.0s/2m20.0s

running (1m02.0s), 100/100 VUs, 425 complete and 0 interrupted iterations
default   [  44% ] 100/100 VUs  1m02.0s/2m20.0s

running (1m03.0s), 100/100 VUs, 434 complete and 0 interrupted iterations
default   [  45% ] 100/100 VUs  1m03.0s/2m20.0s

running (1m04.0s), 100/100 VUs, 441 complete and 0 interrupted iterations
default   [  46% ] 100/100 VUs  1m04.0s/2m20.0s

running (1m05.0s), 100/100 VUs, 449 complete and 0 interrupted iterations
default   [  46% ] 100/100 VUs  1m05.0s/2m20.0s

running (1m06.0s), 100/100 VUs, 453 complete and 0 interrupted iterations
default   [  47% ] 100/100 VUs  1m06.0s/2m20.0s

running (1m07.0s), 100/100 VUs, 462 complete and 0 interrupted iterations
default   [  48% ] 100/100 VUs  1m07.0s/2m20.0s

running (1m08.0s), 100/100 VUs, 468 complete and 0 interrupted iterations
default   [  49% ] 100/100 VUs  1m08.0s/2m20.0s

running (1m09.0s), 100/100 VUs, 475 complete and 0 interrupted iterations
default   [  49% ] 100/100 VUs  1m09.0s/2m20.0s

running (1m10.0s), 100/100 VUs, 484 complete and 0 interrupted iterations
default   [  50% ] 100/100 VUs  1m10.0s/2m20.0s

running (1m11.0s), 100/100 VUs, 489 complete and 0 interrupted iterations
default   [  51% ] 100/100 VUs  1m11.0s/2m20.0s

running (1m12.0s), 100/100 VUs, 500 complete and 0 interrupted iterations
default   [  51% ] 100/100 VUs  1m12.0s/2m20.0s

running (1m13.0s), 100/100 VUs, 512 complete and 0 interrupted iterations
default   [  52% ] 100/100 VUs  1m13.0s/2m20.0s

running (1m14.0s), 100/100 VUs, 522 complete and 0 interrupted iterations
default   [  53% ] 100/100 VUs  1m14.0s/2m20.0s

running (1m15.0s), 100/100 VUs, 529 complete and 0 interrupted iterations
default   [  54% ] 100/100 VUs  1m15.0s/2m20.0s

running (1m16.0s), 100/100 VUs, 534 complete and 0 interrupted iterations
default   [  54% ] 100/100 VUs  1m16.0s/2m20.0s

running (1m17.0s), 100/100 VUs, 546 complete and 0 interrupted iterations
default   [  55% ] 100/100 VUs  1m17.0s/2m20.0s

running (1m18.0s), 100/100 VUs, 549 complete and 0 interrupted iterations
default   [  56% ] 100/100 VUs  1m18.0s/2m20.0s

running (1m19.0s), 100/100 VUs, 561 complete and 0 interrupted iterations
default   [  56% ] 100/100 VUs  1m19.0s/2m20.0s

running (1m20.0s), 100/100 VUs, 573 complete and 0 interrupted iterations
default   [  57% ] 100/100 VUs  1m20.0s/2m20.0s

running (1m21.0s), 100/100 VUs, 590 complete and 0 interrupted iterations
default   [  58% ] 100/100 VUs  1m21.0s/2m20.0s

running (1m22.0s), 100/100 VUs, 600 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  1m22.0s/2m20.0s

running (1m23.0s), 100/100 VUs, 611 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  1m23.0s/2m20.0s

running (1m24.0s), 100/100 VUs, 618 complete and 0 interrupted iterations
default   [  60% ] 100/100 VUs  1m24.0s/2m20.0s

running (1m25.0s), 100/100 VUs, 626 complete and 0 interrupted iterations
default   [  61% ] 100/100 VUs  1m25.0s/2m20.0s

running (1m26.0s), 100/100 VUs, 634 complete and 0 interrupted iterations
default   [  61% ] 100/100 VUs  1m26.0s/2m20.0s

running (1m27.0s), 100/100 VUs, 644 complete and 0 interrupted iterations
default   [  62% ] 100/100 VUs  1m27.0s/2m20.0s

running (1m28.0s), 100/100 VUs, 654 complete and 0 interrupted iterations
default   [  63% ] 100/100 VUs  1m28.0s/2m20.0s

running (1m29.0s), 100/100 VUs, 663 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  1m29.0s/2m20.0s

running (1m30.0s), 100/100 VUs, 670 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  1m30.0s/2m20.0s

running (1m31.0s), 100/100 VUs, 681 complete and 0 interrupted iterations
default   [  65% ] 100/100 VUs  1m31.0s/2m20.0s

running (1m32.0s), 100/100 VUs, 693 complete and 0 interrupted iterations
default   [  66% ] 100/100 VUs  1m32.0s/2m20.0s

running (1m33.0s), 100/100 VUs, 703 complete and 0 interrupted iterations
default   [  66% ] 100/100 VUs  1m33.0s/2m20.0s

running (1m34.0s), 100/100 VUs, 714 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  1m34.0s/2m20.0s

running (1m35.0s), 100/100 VUs, 724 complete and 0 interrupted iterations
default   [  68% ] 100/100 VUs  1m35.0s/2m20.0s

running (1m36.0s), 100/100 VUs, 733 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  1m36.0s/2m20.0s

running (1m37.0s), 100/100 VUs, 741 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  1m37.0s/2m20.0s

running (1m38.0s), 100/100 VUs, 753 complete and 0 interrupted iterations
default   [  70% ] 100/100 VUs  1m38.0s/2m20.0s

running (1m39.0s), 100/100 VUs, 761 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  1m39.0s/2m20.0s

running (1m40.0s), 100/100 VUs, 770 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  1m40.0s/2m20.0s

running (1m41.0s), 100/100 VUs, 780 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  1m41.0s/2m20.0s

running (1m42.0s), 100/100 VUs, 791 complete and 0 interrupted iterations
default   [  73% ] 100/100 VUs  1m42.0s/2m20.0s

running (1m43.0s), 100/100 VUs, 805 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  1m43.0s/2m20.0s

running (1m44.0s), 100/100 VUs, 817 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  1m44.0s/2m20.0s

running (1m45.0s), 100/100 VUs, 830 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  1m45.0s/2m20.0s

running (1m46.0s), 100/100 VUs, 838 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  1m46.0s/2m20.0s

running (1m47.0s), 100/100 VUs, 844 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  1m47.0s/2m20.0s

running (1m48.0s), 100/100 VUs, 852 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  1m48.0s/2m20.0s

running (1m49.0s), 100/100 VUs, 860 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  1m49.0s/2m20.0s

running (1m50.0s), 100/100 VUs, 870 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  1m50.0s/2m20.0s

running (1m51.0s), 100/100 VUs, 883 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  1m51.0s/2m20.0s

running (1m52.0s), 100/100 VUs, 889 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  1m52.0s/2m20.0s

running (1m53.0s), 100/100 VUs, 899 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  1m53.0s/2m20.0s

running (1m54.0s), 100/100 VUs, 910 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  1m54.0s/2m20.0s

running (1m55.0s), 100/100 VUs, 918 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  1m55.0s/2m20.0s

running (1m56.0s), 100/100 VUs, 931 complete and 0 interrupted iterations
default   [  83% ] 100/100 VUs  1m56.0s/2m20.0s

running (1m57.0s), 100/100 VUs, 941 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  1m57.0s/2m20.0s

running (1m58.0s), 100/100 VUs, 944 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  1m58.0s/2m20.0s

running (1m59.0s), 100/100 VUs, 956 complete and 0 interrupted iterations
default   [  85% ] 100/100 VUs  1m59.0s/2m20.0s

running (2m00.0s), 100/100 VUs, 970 complete and 0 interrupted iterations
default   [  86% ] 100/100 VUs  2m00.0s/2m20.0s

running (2m01.0s), 100/100 VUs, 982 complete and 0 interrupted iterations
default   [  86% ] 100/100 VUs  2m01.0s/2m20.0s

running (2m02.0s), 100/100 VUs, 992 complete and 0 interrupted iterations
default   [  87% ] 100/100 VUs  2m02.0s/2m20.0s

running (2m03.0s), 098/100 VUs, 1004 complete and 0 interrupted iterations
default   [  88% ] 098/100 VUs  2m03.0s/2m20.0s

running (2m04.0s), 095/100 VUs, 1014 complete and 0 interrupted iterations
default   [  89% ] 095/100 VUs  2m04.0s/2m20.0s

running (2m05.0s), 094/100 VUs, 1025 complete and 0 interrupted iterations
default   [  89% ] 094/100 VUs  2m05.0s/2m20.0s

running (2m06.0s), 091/100 VUs, 1037 complete and 0 interrupted iterations
default   [  90% ] 091/100 VUs  2m06.0s/2m20.0s

running (2m07.0s), 086/100 VUs, 1050 complete and 0 interrupted iterations
default   [  91% ] 086/100 VUs  2m07.0s/2m20.0s

running (2m08.0s), 084/100 VUs, 1057 complete and 0 interrupted iterations
default   [  91% ] 084/100 VUs  2m08.0s/2m20.0s

running (2m09.0s), 077/100 VUs, 1067 complete and 0 interrupted iterations
default   [  92% ] 077/100 VUs  2m09.0s/2m20.0s

running (2m10.0s), 075/100 VUs, 1075 complete and 0 interrupted iterations
default   [  93% ] 075/100 VUs  2m10.0s/2m20.0s

running (2m11.0s), 070/100 VUs, 1081 complete and 0 interrupted iterations
default   [  94% ] 070/100 VUs  2m11.0s/2m20.0s

running (2m12.0s), 068/100 VUs, 1086 complete and 0 interrupted iterations
default   [  94% ] 068/100 VUs  2m12.0s/2m20.0s

running (2m13.0s), 064/100 VUs, 1095 complete and 0 interrupted iterations
default   [  95% ] 064/100 VUs  2m13.0s/2m20.0s

running (2m14.0s), 055/100 VUs, 1107 complete and 0 interrupted iterations
default   [  96% ] 055/100 VUs  2m14.0s/2m20.0s

running (2m15.0s), 050/100 VUs, 1115 complete and 0 interrupted iterations
default   [  96% ] 050/100 VUs  2m15.0s/2m20.0s

running (2m16.0s), 044/100 VUs, 1124 complete and 0 interrupted iterations
default   [  97% ] 044/100 VUs  2m16.0s/2m20.0s

running (2m17.0s), 035/100 VUs, 1135 complete and 0 interrupted iterations
default   [  98% ] 035/100 VUs  2m17.0s/2m20.0s

running (2m18.0s), 033/100 VUs, 1138 complete and 0 interrupted iterations
default   [  99% ] 033/100 VUs  2m18.0s/2m20.0s

running (2m19.0s), 031/100 VUs, 1141 complete and 0 interrupted iterations
default   [  99% ] 031/100 VUs  2m19.0s/2m20.0s

running (2m20.0s), 028/100 VUs, 1145 complete and 0 interrupted iterations
default   [ 100% ] 028/100 VUs  2m20.0s/2m20.0s

running (2m21.0s), 021/100 VUs, 1152 complete and 0 interrupted iterations
default ↓ [ 100% ] 027/100 VUs  2m20s

running (2m22.0s), 018/100 VUs, 1155 complete and 0 interrupted iterations
default ↓ [ 100% ] 027/100 VUs  2m20s

running (2m23.0s), 012/100 VUs, 1161 complete and 0 interrupted iterations
default ↓ [ 100% ] 027/100 VUs  2m20s

running (2m24.0s), 011/100 VUs, 1162 complete and 0 interrupted iterations
default ↓ [ 100% ] 027/100 VUs  2m20s

running (2m25.0s), 010/100 VUs, 1163 complete and 0 interrupted iterations
default ↓ [ 100% ] 027/100 VUs  2m20s

running (2m26.0s), 009/100 VUs, 1164 complete and 0 interrupted iterations
default ↓ [ 100% ] 027/100 VUs  2m20s

running (2m27.0s), 005/100 VUs, 1168 complete and 0 interrupted iterations
default ↓ [ 100% ] 027/100 VUs  2m20s

running (2m28.0s), 002/100 VUs, 1171 complete and 0 interrupted iterations
default ↓ [ 100% ] 027/100 VUs  2m20s


  █ THRESHOLDS 

    http_req_duration{group:::categoria}
    ✓ 'p(95)<1500' p(95)=1.11s
    ✓ 'p(99)<2500' p(99)=2.32s

    http_req_duration{group:::categorias_listado}
    ✓ 'p(95)<1200' p(95)=1.1s
    ✗ 'p(99)<2000' p(99)=2.1s

    http_req_duration{group:::checkout_shell}
    ✓ 'p(95)<1500' p(95)=973.33ms
    ✓ 'p(99)<2500' p(99)=1.04s

    http_req_duration{group:::home}
    ✓ 'p(95)<1500' p(95)=1.26s
    ✓ 'p(99)<2500' p(99)=2.02s

    http_req_duration{group:::listado_productos}
    ✓ 'p(95)<1500' p(95)=1.36s
    ✓ 'p(99)<2500' p(99)=2.33s

    http_req_duration{group:::paginas_estaticas}
    ✗ 'p(95)<800' p(95)=1.16s
    ✗ 'p(99)<1500' p(99)=1.99s

    http_req_duration{group:::producto}
    ✓ 'p(95)<1200' p(95)=1.04s
    ✓ 'p(99)<2000' p(99)=1.58s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    solicitudes_a_rutas_prohibidas
    ✓ 'count==0' count=0


  █ TOTAL RESULTS 

    checks_total.......: 11772   79.269192/s
    checks_succeeded...: 100.00% 11772 out of 11772
    checks_failed......: 0.00%   0 out of 11772

    ✓ status es 200
    ✓ no es 5xx
    ✓ respuesta no vacía

    CUSTOM
    cliente_descarga...................: avg=243.79ms min=24.48ms  med=166.4ms  max=4.51s    p(90)=441.15ms p(95)=620.62ms p(99)=1.35s   
    cliente_dns_bloqueo................: avg=8.29ms   min=0s       med=0s       max=1.08s    p(90)=0s       p(95)=0s       p(99)=283.48ms
    cliente_tcp_conexion...............: avg=3.14ms   min=0s       med=0s       max=487.34ms p(90)=0s       p(95)=0s       p(99)=103.59ms
    cliente_tiempo_total...............: avg=617.59ms min=250.93ms med=516.03ms max=5.32s    p(90)=973.61ms p(95)=1.18s    p(99)=2.04s   
    cliente_tls_handshake..............: avg=5.14ms   min=0s       med=0s       max=758.04ms p(90)=0s       p(95)=0s       p(99)=186.09ms
    cliente_ttfb_espera................: avg=373.72ms min=178.79ms med=323.69ms max=2.22s    p(90)=571.5ms  p(95)=655.49ms p(99)=986.26ms
    http_estado_2xx....................: 3924   26.423064/s
    solicitudes_a_rutas_prohibidas.....: 0      0/s
    vercel_cache_miss..................: 3924   26.423064/s
    vercel_cache_miss_categoria........: 511    3.440924/s
    vercel_cache_miss_categorias.......: 218    1.467948/s
    vercel_cache_miss_checkout.........: 86     0.579099/s
    vercel_cache_miss_home.............: 1173   7.898638/s
    vercel_cache_miss_producto.........: 970    6.531695/s
    vercel_cache_miss_products.........: 845    5.689982/s

    HTTP
    http_req_duration..................: avg=617.59ms min=250.93ms med=516.03ms max=5.32s    p(90)=973.61ms p(95)=1.18s    p(99)=2.04s   
      { expected_response:true }.......: avg=617.59ms min=250.93ms med=516.03ms max=5.32s    p(90)=973.61ms p(95)=1.18s    p(99)=2.04s   
      { group:::categoria }............: avg=601.47ms min=271.37ms med=485.36ms max=5.32s    p(90)=963.71ms p(95)=1.11s    p(99)=2.32s   
      { group:::categorias_listado }...: avg=589.8ms  min=269.62ms med=492.23ms max=2.55s    p(90)=889.23ms p(95)=1.1s     p(99)=2.1s    
      { group:::checkout_shell }.......: avg=509.25ms min=260.71ms med=422.23ms max=1.19s    p(90)=832.88ms p(95)=973.33ms p(99)=1.04s   
      { group:::home }.................: avg=635.17ms min=272.86ms med=535.75ms max=3.81s    p(90)=984.95ms p(95)=1.26s    p(99)=2.02s   
      { group:::listado_productos }....: avg=673.38ms min=278.63ms med=555.25ms max=4.15s    p(90)=1.05s    p(95)=1.36s    p(99)=2.33s   
      { group:::paginas_estaticas }....: avg=580.56ms min=276.29ms med=506.12ms max=2.44s    p(90)=850.43ms p(95)=1.16s    p(99)=1.99s   
      { group:::producto }.............: avg=576.7ms  min=250.93ms med=484.64ms max=3.49s    p(90)=907.31ms p(95)=1.04s    p(99)=1.58s   
    http_req_failed....................: 0.00%  0 out of 3924
    http_reqs..........................: 3924   26.423064/s

    EXECUTION
    iteration_duration.................: avg=10.23s   min=1.51s    med=9.97s    max=27.1s    p(90)=15.45s   p(95)=17.02s   p(99)=20.81s  
    iterations.........................: 1173   7.898638/s
    vus................................: 2      min=2         max=100
    vus_max............................: 100    min=100       max=100

    NETWORK
    data_received......................: 766 MB 5.2 MB/s
    data_sent..........................: 2.9 MB 20 kB/s



running (2m28.5s), 000/100 VUs, 1173 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  2m20s
time="2026-09-15T13:08:19-04:00" level=error msg="thresholds on metrics 'http_req_duration{group:::categorias_listado}, http_req_duration{group:::paginas_estaticas}' have been crossed"